---
type: IFCExtrusionCreationData
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 24
tags: [revit-api, class]
---

# IFCExtrusionCreationData

`Autodesk.Revit.DB.IFC.IFCExtrusionCreationData` · Revit 2024 · 24 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCExtrusionCreationData | 2012 | `public IFCExtrusionCreationData ()` |
| Method | AddOpening | 2012 | `public void AddOpening ( IFCExtrusionData data )` |
| Method | ClearOpenings | 2012 | `public void ClearOpenings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetLocalPlacement | 2012 | `public IFCAnyHandle GetLocalPlacement ()` |
| Method | GetOpenings | 2012 | `public IList < IFCExtrusionData > GetOpenings ()` |
| Method | SetLocalPlacement | 2012 | `public void SetLocalPlacement ( IFCAnyHandle localPlacement )` |
| Property | AllowVerticalOffsetOfBReps | 2013 | `public bool AllowVerticalOffsetOfBReps { get ; set ; }` |
| Property | AreInnerRegionsOpenings | 2012 | `public bool AreInnerRegionsOpenings { get ; set ; }` |
| Property | CustomAxis | 2012 | `public XYZ CustomAxis { get ; set ; }` |
| Property | ExtrusionDirection | 2012 | `public XYZ ExtrusionDirection { get ; set ; }` |
| Property | ForceOffset | 2014 | `public bool ForceOffset { get ; set ; }` |
| Property | HasCustomAxis | 2012 | `public bool HasCustomAxis { get ; }` |
| Property | HasExtrusionDirection | 2012 | `public bool HasExtrusionDirection { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PossibleExtrusionAxes | 2012 | `public IFCExtrusionAxes PossibleExtrusionAxes { get ; set ; }` |
| Property | ReuseLocalPlacement | 2013 | `public bool ReuseLocalPlacement { get ; set ; }` |
| Property | ScaledArea | 2012 | `public double ScaledArea { get ; set ; }` |
| Property | ScaledHeight | 2012 | `public double ScaledHeight { get ; set ; }` |
| Property | ScaledInnerPerimeter | 2012 | `public double ScaledInnerPerimeter { get ; set ; }` |
| Property | ScaledLength | 2012 | `public double ScaledLength { get ; set ; }` |
| Property | ScaledOuterPerimeter | 2012 | `public double ScaledOuterPerimeter { get ; set ; }` |
| Property | ScaledWidth | 2012 | `public double ScaledWidth { get ; set ; }` |
| Property | Slope | 2012 | `public double Slope { get ; set ; }` |